/*TODO routePoint*/
export var datas = {
  WHG: {
    "3F": {
      labelArray: [
        { text: "展厅", position: [0, 8, -48], type: 1 },
        { text: "img:./images/louti.png", position: [-5, 8, -65], type: 1 },
        { text: "img:./images/dianti.png", position: [0, 8, -65], type: 1 },
        { text: "前室", position: [0, 8, -74], type: 1 },
        { text: "img:./images/louti.png", position: [5, 8, -65], type: 1 },
        { text: "前室", position: [14, 8, -65], type: 1 },
        { text: "前室", position: [-18, 8, -65], type: 1 },
        { text: "空调机房", position: [10, 8, -74], type: 1 },
        { text: "空调机房", position: [-10, 8, -74], type: 1 },
        //
        { text: "img:./images/dianti.png", position: [107, 8, -70], type: 1 },
        { text: "img:./images/louti.png", position: [120, 8, -80], type: 1 },
        // {text:"新白鹿11",position:[100.578,3.1,-13.4],type:2},
        { text: "声乐排练间(中大型)", position: [85, 8, -60], type: 3 },
        { text: "声乐排练间(小型)", position: [60, 8, -70], type: 1 },
        { text: "img:./images/louti.png", position: [88, 8, -6], type: 1 },
        { text: "img:./images/louti.png", position: [88, 8, -36], type: 1 },
        { text: "观众厅天面", position: [90, 8, -22], type: 4 },
        //声乐排练间右边
        { text: "img:./images/louti.png", position: [107, 8, -20], type: 1 },
        { text: "img:./images/cisuo.png", position: [107, 8, -80], type: 1 },
        { text: "img:./images/dianti.png", position: [107, 8, -70], type: 1 },
        { text: "img:./images/louti.png", position: [120, 8, -80], type: 1 },
        //园区
        { text: "img:./images/dianti.png", position: [-90, 8, -60], type: 1 },
        { text: "img:./images/cisuo.png", position: [-40, 8, -80], type: 1 },
        { text: "img:./images/louti.png", position: [-30, 8, -80], type: 1 },
        { text: "img:./images/louti.png", position: [-102, 8, -80], type: 1 },
        { text: "接待室", position: [-92, 8, -80], type: 4 },
        { text: "理论宣传室", position: [-78, 8, -75], type: 4 },
        { text: "活动策划部", position: [-60, 8, -78], type: 4 },
        { text: "园区办公室", position: [-36, 8, -55], type: 4 },
        { text: "推广合作部", position: [-56, 8, -60], type: 4 },
        { text: "培训辅导部", position: [-76, 8, -56], type: 4 }
      ],
      floorInfo: {
        buildingId: "3f",
        buildingName: "3F",
        center: [0, 0, 0],
        buildingItem: [
          {
            type: "floor",
            name: "地板",
            points: [
              [146, 0, 0],
              [65.6, 0, 0],
              [65.6, 0, -50],
              [24, 0, -50],
              [24, 0, -30],
              [-24, 0, -30],
              [-24, 0, -50],
              [-108, 0, -50],
              [-108, 0, -90],
              [-108, 0, -90],
              [98, 0, -90],
              [146, 0, -90]
            ]
          },
          {
            type: "cell",
            name: "舞台上空",
            routePoint: 0,
            color: 2,
            points: [
              [133, 0, -6],
              [108, 0, -6],
              [108, 0, -34],
              [133, 0, -34]
            ]
          },
          {
            type: "cell",
            name: "观众厅天面",
            routePoint: 0,
            color: 2,
            points: [
              [106, 0, -3.2],
              [73, 0, -3.2],
              [73, 0, -38],
              [105, 0, -38]
            ]
          },
          {
            type: "cell",
            name: "声乐排练厅(小型)",
            routePoint: 3,
            color: 1,
            points: [
              [66, 0, -53],
              [46, 0, -54],
              [46, 0, -88],
              [66, 0, -88]
            ]
          },
          {
            type: "cell",
            name: "声乐排练厅(大型)",
            routePoint: 3,
            color: 1,
            points: [
              [100, 0, -53],
              [70, 0, -54],
              [70, 0, -88],
              [100, 0, -88]
            ]
          },
          // {type:"cell",name:"展厅下面上空",routePoint:5,color:2,points:[[10,0,-34],[-10,0,-34],[-10,0,-40],[10,0,-40]]},
          {
            type: "cell",
            name: "展厅",
            routePoint: 5,
            color: 1,
            points: [
              [14, 0, -40],
              [-14, 0, -40],
              [-14, 0, -50],
              [-20, 0, -50],
              [-20, 0, -72],
              [-14, 0, -72],
              [-14, 0, -82],
              [14, 0, -82],
              [14, 0, -72],
              [20, 0, -72],
              [20, 0, -50],
              [14, 0, -50]
            ]
          },
          {
            type: "cell",
            name: "空调机房",
            routePoint: 5,
            color: 2,
            points: [
              [10, 1, -70],
              [2, 1, -70],
              [2, 1, -80],
              [10, 1, -80]
            ]
          },
          {
            type: "cell",
            name: "前室",
            routePoint: 5,
            color: 2,
            points: [
              [0, 1, -70],
              [-4, 1, -70],
              [-4, 1, -80],
              [0, 1, -80]
            ]
          },
          {
            type: "cell",
            name: "空调机房",
            routePoint: 5,
            color: 2,
            points: [
              [-6, 1, -70],
              [-13, 1, -70],
              [-13, 1, -80],
              [-6, 1, -80]
            ]
          },
          {
            type: "cell",
            name: "前室",
            routePoint: 5,
            color: 2,
            points: [
              [-13, 1, -60],
              [-20, 1, -60],
              [-20, 1, -70],
              [-13, 1, -70]
            ]
          },
          {
            type: "cell",
            name: "前室",
            routePoint: 5,
            color: 2,
            points: [
              [16, 1, -60],
              [10, 1, -60],
              [10, 1, -70],
              [16, 1, -70]
            ]
          },
          // {type:"cell",name:"声乐排练间(中大型)",routePoint:3,color:1,points:[[70.0,0.1,-51.80],[58.0,0.1,-51.80],[58.0,0.1,-66.00],[70.0,0.1,-66.00]]},
          {
            type: "cell",
            name: "园区办公室",
            routePoint: 7,
            color: 1,
            points: [
              [-30, 0, -54],
              [-48, 0, -54],
              [-48, 0, -66],
              [-30, 0, -66]
            ]
          },
          {
            type: "cell",
            name: "推广合作部",
            routePoint: 7,
            color: 1,
            points: [
              [-50, 0, -54],
              [-68, 0, -54],
              [-68, 0, -66],
              [-50, 0, -66]
            ]
          },
          {
            type: "cell",
            name: "培训辅导部",
            routePoint: 7,
            color: 1,
            points: [
              [-70, 0, -54],
              [-88, 0, -54],
              [-88, 0, -66],
              [-70, 0, -66]
            ]
          },
          {
            type: "gallery",
            name: "走廊",
            routePoint: 7,
            color: 2,
            points: [
              [-30, 0, -68],
              [-88, 0, -68],
              [-88, 0, -72],
              [-30, 0, -72]
            ]
          },
          {
            type: "cell",
            name: "活动策划部",
            routePoint: 7,
            color: 1,
            points: [
              [-50, 0, -74],
              [-70, 0, -74],
              [-70, 0, -86],
              [-50, 0, -86]
            ]
          },
          {
            type: "cell",
            name: "理论宣传部",
            routePoint: 7,
            color: 1,
            points: [
              [-72, 0, -74],
              [-88, 0, -74],
              [-88, 0, -86],
              [-72, 0, -86]
            ]
          },
          {
            type: "cell",
            name: "接待室",
            routePoint: 7,
            color: 1,
            points: [
              [-90, 0, -74],
              [-98, 0, -74],
              [-98, 0, -86],
              [-90, 0, -86]
            ]
          }
        ]
      }
    },
    "2F": {
      labelArray: [
        { text: "美术书法教室", position: [-71.811, 8, -26.619], type: 1 },
        { text: "中型阶梯教室", position: [-114.858, 8, -60.967], type: 1 },
        { text: "小会议室", position: [-104.835, 8, -90.639], type: 1 },
        { text: "中会议室", position: [-69.256, 8, -76.954], type: 4 },
        { text: "大会议室", position: [-52.256, 8, -76.954], type: 1 },
        { text: "展厅", position: [-18.276, 8, -76.932], type: 1 },
        { text: "声乐排练厅（中型）", position: [48.744, 8, -94.641], type: 1 },
        { text: "声乐排练厅（小型）", position: [64.132, 8, -74.405], type: 1 },
        { text: "茶座", position: [30.726, 8, -26.167], type: 1 },
        { text: "书记室", position: [-92.75, 10, -86], type: 1 },
        { text: "馆长室", position: [-82.75, 10, -90], type: 1 },
        { text: "行政办公室", position: [-88.274, 8, -100.786], type: 1 },
        { text: "休息平台", position: [12.184, 10, -96.17], type: 1 },
        { text: "数字化服务部", position: [22.884, 13, -75.17], type: 1 },
        { text: "观众厅上空", position: [79.004, 10, -51.567], type: 1 },
        { text: "舞台上空", position: [104.004, 10, -51.567], type: 1 },
        { text: "休息平台", position: [-50.21, 10, -96.317], type: 1 },
        { text: "走廊", position: [-51.21, 10, -90.317], type: 1 },
        { text: "走廊", position: [-32.547, 10, -94.088], type: 1 },
        { text: "走廊", position: [-110.729, 10, -74.531], type: 1 },
        { text: "走廊", position: [-70.821, 10, -90.779], type: 1 },
        { text: "走廊", position: [10.698, 10, -84.486], type: 1 },
        { text: "二层平台", position: [-37.812, 10, -80.231], type: 1 },
        {
          text: "img:./images/louti.png",
          position: [-43.908, 9, -10.691],
          type: 1
        },
        {
          text: "img:./images/louti.png",
          position: [2.622, 9, -10.536],
          type: 1
        },
        {
          text: "img:./images/louti.png",
          position: [-102.889, 9, -104.088],
          type: 1
        },
        {
          text: "img:./images/louti.png",
          position: [-54.18, 9, -26.536],
          type: 1
        },
        {
          text: "img:./images/louti.png",
          position: [21.804, 9, -26.962],
          type: 1
        },
        {
          text: "img:./images/dianti.png",
          position: [40.01, 9, -26.91],
          type: 1
        },
        {
          text: "img:./images/louti.png",
          position: [46.446, 9, -26.962],
          type: 1
        },
        {
          text: "img:./images/louti.png",
          position: [-70.771, 9, -44.145],
          type: 1
        },
        {
          text: "img:./images/louti.png",
          position: [-106.769, 9, -44.893],
          type: 1
        },
        {
          text: "img:./images/cisuo.png",
          position: [-80.769, 9, -44.093],
          type: 1
        },
        {
          text: "img:./images/cisuo.png",
          position: [-118.769, 9, -78.093],
          type: 1
        },
        {
          text: "img:./images/dianti.png",
          position: [-106.769, 9, -96.093],
          type: 1
        },
        {
          text: "img:./images/cisuo.png",
          position: [-78.032, 9, -103.984],
          type: 1
        },
        {
          text: "img:./images/louti.png",
          position: [-70.032, 9, -103.984],
          type: 1
        },
        {
          text: "img:./images/cisuo.png",
          position: [-18.27, 9, -87.599],
          type: 1
        },
        {
          text: "img:./images/louti.png",
          position: [-18.27, 9, -68.599],
          type: 1
        },
        {
          text: "img:./images/dianti.png",
          position: [-18.27, 9, -82.599],
          type: 1
        },
        {
          text: "img:./images/louti.png",
          position: [28.184, 9, -96.17],
          type: 1
        },
        {
          text: "img:./images/cisuo.png",
          position: [62.184, 9, -96.17],
          type: 1
        },
        {
          text: "img:./images/louti.png",
          position: [68.184, 9, -102.17],
          type: 1
        },
        {
          text: "img:./images/dianti.png",
          position: [68.184, 9, -94.17],
          type: 1
        },
        {
          text: "img:./images/louti.png",
          position: [118.184, 9, -66.17],
          type: 1
        },
        {
          text: "img:./images/louti.png",
          position: [114.184, 9, -30.17],
          type: 1
        },
        {
          text: "img:./images/louti.png",
          position: [80.184, 9, -65.17],
          type: 1
        },
      ],
      floorInfo: {
        buildingId: "2f",
        buildingName: "楼层2",
        center: [0, 0, 0],
        buildingItem: [
          {
            type: "floor",
            name: "地板",
            points: [
              [15.684, 0, 0.023],
              [-4.292, 0, -0.106],
              [-4.292, 0, -19.033],
              [4.966, 0, -19.085],
              [4.634, 0, -35.003],
              [51.423, 0, -35.003],
              [51.225, 0, -74.928],
              [55.927, 0, -75.599],
              [55.927, 0, -82.983],
              [36.887, 0, -83.089],
              [37.562, 0, -72.973],
              [3.145, 0, -72.973],
              [3.923, 0, -106.954],
              [19.47, 0, -106.954],
              [19.044, 0, -93.332],
              [25.859, 0, -93.758],
              [25.859, 0, -106.954],
              [72.83, 0, -106.954],
              [72.878, 0, -99.47],
              [78.778, 0, -99.47],
              [78.644, 0, -77.49],
              [88.3, 0, -77.49],
              [88.032, 0, -84.995],
              [116.463, 0, -84.861],
              [116.143, 0, -79.334],
              [124.294, 0, -79.12],
              [123.651, 0, -71.402],
              [127.726, 0, -71.188],
              [127.873, 0, -35.367],
              [122.899, 0, -35.367],
              [122.63, 0, -16.962],
              [15.658, 0, -16.451]
            ]
          },
          {
            type: "floor",
            name: "地板左",
            points: [
              [-37.45, 0, -2.165],
              [-53.694, 0, -1.893],
              [-53.694, 0, -19.217],
              [-94.336, 0, -19.088],
              [-93.899, 0, -32.832],
              [-88.005, 0, -33.268],
              [-88.223, 0, -35.886],
              [-113.11, 0, -35.668],
              [-113.11, 0, -48.539],
              [-126.341, 0, -48.4],
              [-126.341, 0, -83.548],
              [-115.35, 0, -82.889],
              [-115.722, 0, -106.527],
              [-67.728, 0, -106.246],
              [-67.868, 0, -92.223],
              [-58.562, 0, -92.395],
              [-58.787, 0, -106.525],
              [-44.872, 0, -106.525],
              [-45.021, 0, -103.058],
              [-37.839, 0, -102.917],
              [-37.698, 0, -106.857],
              [-3.338, 0, -106.716],
              [-3.197, 0, -99.947],
              [3.759, 0, -99.796],
              [4.181, 0, -91.904],
              [-1.799, 0, -91.8],
              [-1.234, 0, -64.123],
              [-2.93, 0, -64.123],
              [-2.364, 0, -58.898],
              [-36.278, 0, -58.757],
              [-36.137, 0, -64.123],
              [-41.365, 0, -63.84],
              [-41.224, 0, -91.659],
              [-44.192, 0, -91.517],
              [-43.909, 0, -71.607],
              [-78.106, 0, -71.607],
              [-78.247, 0, -83.61],
              [-100.574, 0, -83.468],
              [-100.291, 0, -53.956],
              [-66.66, 0, -53.673],
              [-66.66, 0, -35.316],
              [-47.583, 0, -35.034],
              [-47.577, 0, -18.188],
              [-37.226, 0, -18.188]
            ]
          },
          {
            type: "cell",
            name: "A区",
            routePoint: 0,
            color: 2,
            points: [
              [7.65, 0, -5.4],
              [-1.5, 0, -5.4],
              [-1.55, 0, -14.6],
              [7.6, 0, -14.6]
            ]
          },
          {
            type: "cell",
            name: "B区",
            routePoint: 1,
            color: 2,
            points: [
              [-40.3, 0, -5.4],
              [-49.5, 0, -5.4],
              [-49.55, 0, -14.6],
              [-40.5, 0, -14.6]
            ]
          },
          {
            type: "cell",
            name: "茶座",
            routePoint: 2,
            color: 2,
            points: [
              [50.088, 0, -20.587],
              [15.431, 0, -20.587],
              [15.692, 0, -32.885],
              [50.088, 0, -32.646]
            ]
          },
          {
            type: "cell",
            name: "美术书法教室",
            routePoint: 3,
            color: 0,
            points: [
              [-51.634, 0, -20.781],
              [-83.243, 0, -21.228],
              [-83.243, 0, -32.253],
              [-77.981, 0, -32.206],
              [-77.977, 0, -38.958],
              [-110.23, 0, -38.809],
              [-110.23, 0, -50.58],
              [-69.675, 0, -50.133],
              [-69.526, 0, -38.809],
              [-75.042, 0, -38.809],
              [-75.191, 0, -32.7],
              [-51.634, 0, -32.104]
            ]
          },
          {
            type: "cell",
            name: "小会议室",
            routePoint: 4,
            color: 2,
            points: [
              [-76.92, 0, -86.457],
              [-108.74, 0, -86.457],
              [-108.813, 0, -96.356],
              [-76.837, 0, -96.6]
            ]
          },
          {
            type: "cell",
            name: "中型阶梯教室",
            routePoint: 5,
            color: 0,
            points: [
              [-114.985, 0, -53.259],
              [-124.328, 0, -53.527],
              [-124.328, 0, -78.804],
              [-114.985, 0, -79.072]
            ]
          },
          {
            type: "cell",
            name: "大会议室",
            routePoint: 4,
            color: 2,
            points: [
              [-47.407, 0, -75.006],
              [-74.083, 0, -75.156],
              [-73.783, 0, -86.389],
              [-47.257, 0, -86.389]
            ]
          },
          {
            type: "cell",
            name: "展厅",
            routePoint: 6,
            color: 2,
            points: [
              [-6.878, 0, -66.051],
              [-33.004, 0, -66.078],
              [-32.736, 0, -90.118],
              [-6.81, 0, -90.582]
            ]
          },
          {
            type: "cell",
            name: "声乐排练厅（中型）",
            routePoint: 7,
            color: 0,
            points: [
              [60.474, 0, -90.751],
              [30.784, 0, -90.483],
              [30.441, 0, -104.026],
              [60.403, 0, -103.894]
            ]
          },
          {
            type: "cell",
            name: "声乐排练厅（小型）",
            routePoint: 8,
            color: 0,
            points: [
              [68.803, 0, -70.346],
              [58.661, 0, -70.309],
              [58.661, 0, -82.399],
              [68.803, 0, -82.337]
            ]
          },
          {
            type: "cell",
            name: "书记室",
            routePoint: 4,
            color: 1,
            points: [
              [-90.77, 2, -88.549],
              [-94.997, 2, -88.489],
              [-95.193, 2, -94.823],
              [-90.82, 2, -94.662]
            ]
          },
          {
            type: "cell",
            name: "馆长室",
            routePoint: 4,
            color: 1,
            points: [
              [-80.77, 2, -88.549],
              [-84.997, 2, -88.489],
              [-85.193, 2, -94.823],
              [-80.82, 2, -94.662]
            ]
          },
          {
            type: "cell",
            name: "行政办公室",
            routePoint: 9,
            color: 1,
            points: [
              [-76.92, 0, -99.457],
              [-108.74, 0, -98.957],
              [-108.813, 0, -104.356],
              [-76.837, 0, -104.6]
            ]
          },
          {
            type: "cell",
            name: "休息平台",
            routePoint: 10,
            color: 2,
            points: [
              [-46.182, 0, -92.645],
              [-55.779, 0, -92.645],
              [-55.682, 0, -101.426],
              [-46.27, 0, -101.599]
            ]
          },
          {
            type: "cell",
            name: "休息平台",
            routePoint: 11,
            color: 2,
            points: [
              [16.162, 0, -92.777],
              [6.279, 0, -92.777],
              [6.37, 0, -100.144],
              [16.057, 0, -100.04]
            ]
          },
          {
            type: "cell",
            name: "数字化服务部",
            routePoint: 12,
            color: 2,
            points: [
              [34.255, 0, -73.591],
              [7.298, 0, -73.486],
              [7.319, 0, -80.144],
              [34.057, 0, -80.04]
            ]
          },
          {
            type: "cell",
            name: "舞台",
            routePoint: 13,
            color: 2,
            points: [
              [116.417, 0, -26.115],
              [54.339, 0, -26.115],
              [54.339, 0, -66.811],
              [116.417, 0, -66.702]
            ]
          },
          {
            type: "cell",
            name: "观众厅上空",
            routePoint: 13,
            color: 1,
            points: [
              [85.276, 2, -35.813],
              [65.53, 2, -35.999],
              [65.031, 2, -62.787],
              [85.23, 2, -63.151],
              [94.595, 2, -58.436],
              [94.378, 2, -40.816]
            ]
          },
          {
            type: "cell",
            name: "舞台上空",
            routePoint: 13,
            color: 1,
            points: [
              [112.175, 2, -36.192],
              [95.509, 2, -35.192],
              [95.03, 2, -62.8],
              [112.175, 2, -62.345]
            ]
          },
          {
            type: "gallery",
            name: "走廊",
            routePoint: -1,
            color: 2,
            points: [
              [-48.182, 0, -84.645],
              [-54.779, 0, -84.645],
              [-54.682, 0, -93.426],
              [-48.27, 0, -93.599]
            ]
          },
          {
            type: "gallery",
            name: "走廊",
            routePoint: -1,
            color: 2,
            points: [
              [6.895, 0, -93.925],
              [-47.272, 0, -93.744],
              [-47.327, 0, -99.003],
              [8.895, 0, -98.87]
            ]
          },
          {
            type: "gallery",
            name: "走廊",
            routePoint: -1,
            color: 2,
            points: [
              [-108.698, 0, -50.659],
              [-113.287, 0, -50.553],
              [-114.0, 0, -94.617],
              [-108.627, 0, -94.786]
            ]
          },
          {
            type: "gallery",
            name: "走廊",
            routePoint: -1,
            color: 2,
            points: [
              [-68.14, 0, -95.769],
              [-111.898, 0, -95.769],
              [-111.727, 0, -99.482],
              [-68.14, 0, -99.482]
            ]
          },
          {
            type: "gallery",
            name: "走廊",
            routePoint: -1,
            color: 2,
            points: [
              [-68.14, 0, -84.769],
              [-70.898, 0, -84.769],
              [-70.727, 0, -95.482],
              [-68.14, 0, -95.482]
            ]
          },
          {
            type: "gallery",
            name: "走廊",
            routePoint: -1,
            color: 2,
            points: [
              [12.43, 0, -79.298],
              [7.697, 0, -79.436],
              [7.42, 0, -93.947],
              [12.638, 0, -93.909]
            ]
          },
          {
            type: "gallery",
            name: "走廊",
            routePoint: -1,
            color: 2,
            points: [
              [28.125, 0, -82.753],
              [10.565, 0, -82.306],
              [10.677, 0, -84.539],
              [28.125, 0, -84.539]
            ]
          },
          {
            type: "gallery",
            name: "走廊",
            routePoint: -1,
            color: 2,
            points: [
              [28.125, 0, -82.753],
              [26.565, 0, -82.753],
              [26.677, 0, -94.539],
              [28.125, 0, -94.539]
            ]
          },
          {
            type: "gallery",
            name: "走廊",
            routePoint: -1,
            color: 2,
            points: [
              [74.125, 0, -84.753],
              [26.565, 0, -84.753],
              [26.677, 0, -88.539],
              [74.125, 0, -88.539]
            ]
          },
          {
            type: "gallery",
            name: "走廊",
            routePoint: -1,
            color: 2,
            points: [
              [58.125, 0, -80.753],
              [56.565, 0, -80.753],
              [56.677, 0, -84.539],
              [58.125, 0, -84.539]
            ]
          }
        ]
      }
    },
    "1F": {
      floorInfo: {
        buildingId: "1f",
        buildingName: "1F",
        center: [120, 30, 6],
        buildingItem: [
          // {type:"floor",name:"地板",points:[[-139,0,-148],[158,0,-148],[158,0,0],[-140,0,0]]},
          {
            type: "floor",
            name: "地板",
            points: [
              [-129, 0, -82],
              [-109, 0, -82],
              [-109, 0, -109],
              [-106, 0, -109],
              [-106, 0, -134],
              [-95, 0, -134],
              [-95, 0, -137],
              [-47, 0, -137],
              [-47, 0, -120],
              [-39, 0, -120],
              [-39, 0, -120],
              [-39, 0, -129],
              [-44, 0, -129],
              [-44, 0, -144],
              [-18, 0, -144],
              [-18, 0, -134],
              [20, 0, -134],
              [20, 0, -138],
              [38, 0, -138],
              [38, 0, -122],
              [48, 0, -122],
              [48, 0, -138],
              [100, 0, -138],
              [100, 0, -105],
              [107, 0, -105],
              [107, 0, -113],
              [135, 0, -113],
              [135, 0, -108],
              [148, 0, -108],
              [148, 0, -63],
              [145, 0, -63],
              [142, 0, -57],
              [138, 0, -57],
              [140, 0, -57],
              [140, 0, -50],
              [104, 0, -50],
              [104, 0, -37],
              [82, 0, -37],
              [82, 0, -50],
              [85, 0, -50],
              [85, 0, -60],
              [73, 0, -60],
              [73, 0, -30],
              [78, 0, -30],
              [78, 0, -14],
              [61, 0, -14],
              [61, 0, -30],
              [66, 0, -30],
              [66, 0, -44],
              [34, 0, -44],
              [34, 0, -28],
              [16, 0, -28],
              [16, 0, -46],
              [26, 0, -46],
              [26, 0, -52],
              [14, 0, -52],
              [14, 0, -45],
              [-14, 0, -45],
              [-14, 0, -52],
              [-28, 0, -52],
              [-28, 0, -50],
              [-24, 0, -50],
              [-24, 0, -43],
              [-19, 0, -43],
              [-19, 0, -29],
              [-33, 0, -29],
              [-34, 0, -40],
              [-38, 0, -40],
              [-38, 0, -44],
              [-68, 0, -44],
              [-68, 0, -62],
              [-97, 0, -62],
              [-97, 0, -43],
              [-114, 0, -43],
              [-114, 0, -62],
              [-129, 0, -62]
            ]
          },
          // 左边
          {
            type: "cell",
            name: "培训门厅",
            routePoint: 304,
            color: 1,
            points: [
              [-101, 0, -129],
              [-92, 0, -129],
              [-92, 0, -111],
              [-101, 0, -111]
            ]
          },
          {
            type: "cell",
            name: "报告厅",
            routePoint: 304,
            color: 2,
            points: [
              [-103, 0, -107],
              [-90, 0, -107],
              [-90, 0, -80],
              [-103, 0, -80]
            ]
          }, // {type:"cell",name:"报告厅的休息室",routePoint:304,color:1,points:[[-101,0,-84],[-97,0,-84],[-97,0,-80],[-101,0,-80]]},
          // {type:"cell",name:"公共卫生间",routePoint:304,color:1,points:[[-124,0,-77],[-113,0,-77],[-113,0,-66],[-124,0,-66]]},
          {
            type: "cell",
            name: "电子阅览",
            routePoint: 304,
            color: 2,
            points: [
              [-85, 0, -132],
              [-58, 0, -132],
              [-58, 0, -118],
              [-85, 0, -118]
            ]
          },
          // {type:"cell",name:"庭院",routePoint:304,color:4,points:[[-82,0,-115],[-54,0,-115],[-54,0,-94],[-67,0,-94],[-67,0,-78],[-85,0,-78],[-85,0,-97],[-82,0,-97],[-82,0,-115]]},
          // {type:"cell",name:"庭院亭子",routePoint:304,color:1,points:[[-68,0,-107],[-61,0,-107],[-61,0,-100],[-68,0,-100]]},
          {
            type: "cell",
            name: "小型普通教室",
            routePoint: 304,
            color: 1,
            points: [
              [-84, 0, -75],
              [-67, 0, -75],
              [-67, 0, -66],
              [-84, 0, -66]
            ]
          },
          {
            type: "cell",
            name: "中型普通教室",
            routePoint: 304,
            color: 1,
            points: [
              [-63, 0, -57],
              [-36, 0, -57],
              [-36, 0, -48],
              [-63, 0, -48]
            ]
          },
          // {type:"cell",name:"庭院-中型普通教室",routePoint:304,color:4,points:[[-63,0,-57],[-36,0,-57],[-36,0,-48],[-63,0,-48]]},
          {
            type: "cell",
            name: "广播站",
            routePoint: 304,
            color: 1,
            points: [
              [-28, 0, -36],
              [-22, 0, -36],
              [-22, 0, -33],
              [-28, 0, -33]
            ]
          },
          {
            type: "cell",
            name: "前室",
            routePoint: 304,
            color: 1,
            points: [
              [-40, 0, -139],
              [-22, 0, -139],
              [-22, 0, -133],
              [-40, 0, -133]
            ]
          },
          {
            type: "cell",
            name: "保安站",
            routePoint: 304,
            color: 1,
            points: [
              [-34, 0, -124],
              [-29, 0, -124],
              [-29, 0, -121],
              [-34, 0, -121]
            ]
          },
          {
            type: "cell",
            name: "小型阶梯教室",
            routePoint: 304,
            color: 1,
            points: [
              [-49, 0, -114],
              [-31, 0, -114],
              [-31, 0, -102],
              [-49, 0, -102]
            ]
          },
          // {type:"cell",name:"庭院-小型阶梯教室",routePoint:304,color:4,points:[[-49,0,-102],[-31,0,-102],[-31,0,-94],[-49,0,-94]]},
          // 中间
          {
            type: "cell",
            name: "展厅",
            routePoint: 304,
            color: 1,
            points: [
              [-15, 0, -128],
              [14, 0, -128],
              [14, 0, -126],
              [17, 0, -126],
              [17, 0, -95],
              [14, 0, -95],
              [14, 0, -89],
              [-14, 0, -89],
              [-14, 0, -95],
              [-17, 0, -95],
              [-17, 0, -126],
              [-15, 0, -126]
            ]
          },
          {
            type: "cell",
            name: "门楼",
            routePoint: 304,
            color: 1,
            points: [
              [-8, 0, -61],
              [8, 0, -61],
              [8, 0, -50],
              [-8, 0, -50]
            ]
          },
          //     // 右边
          // {type:"cell",name:"直线坡段",routePoint:304,color:1,points:[[28,0,-127],[33,0,-127],[33,0,-122],[28,0,-122]]},
          {
            type: "cell",
            name: "档案库房",
            routePoint: 304,
            color: 1,
            points: [
              [26, 0, -116],
              [53, 0, -116],
              [53, 0, -102],
              [26, 0, -102]
            ]
          },
          {
            type: "cell",
            name: "庭院",
            routePoint: 304,
            color: 1,
            points: [
              [26, 0, -116],
              [53, 0, -116],
              [53, 0, -102],
              [26, 0, -102]
            ]
          }, // 档案库房庭院
          {
            type: "cell",
            name: "门厅",
            routePoint: 304,
            color: 1,
            points: [
              [31, 0, -57],
              [62, 0, -57],
              [62, 0, -48],
              [31, 0, -48]
            ]
          },
          {
            type: "cell",
            name: "医疗室",
            routePoint: 304,
            color: 1,
            points: [
              [21, 0, -41],
              [29, 0, -41],
              [29, 0, -33],
              [21, 0, -33]
            ]
          },
          {
            type: "cell",
            name: "舞蹈戏曲排练厅（中型）",
            routePoint: 304,
            color: 1,
            points: [
              [53, 0, -132],
              [76, 0, -132],
              [76, 0, -118],
              [53, 0, -118]
            ]
          },
          {
            type: "cell",
            name: "舞蹈戏曲排练厅（小型）",
            routePoint: 304,
            color: 1,
            points: [
              [83, 0, -116],
              [94, 0, -116],
              [94, 0, -103],
              [83, 0, -103]
            ]
          },
          {
            type: "cell",
            name: "休息室",
            routePoint: 304,
            color: 2,
            points: [
              [89, 0, -120],
              [94, 0, -120],
              [94, 0, -116],
              [89, 0, -116]
            ]
          }, // 休息室-舞蹈戏曲排练厅（小型）
          {
            type: "cell",
            name: "器材储藏",
            routePoint: 304,
            color: 1,
            points: [
              [89, 0, -125],
              [94, 0, -125],
              [94, 0, -120],
              [89, 0, -120]
            ]
          }, // 器材储藏-舞蹈戏曲排练厅（小型）
          {
            type: "cell",
            name: "剧场前厅",
            routePoint: 304,
            color: 1,
            points: [
              [62, 0, -90],
              [80, 0, -90],
              [80, 0, -74],
              [62, 0, -74]
            ]
          },
          {
            type: "cell",
            name: "观众厅",
            routePoint: 304,
            color: 2,
            points: [
              [80, 0, -95],
              [112, 0, -95],
              [112, 0, -69],
              [80, 0, -69]
            ]
          },
          {
            type: "cell",
            name: "舞台",
            routePoint: 304,
            color: 1,
            points: [
              [112, 0, -95],
              [130, 0, -95],
              [130, 0, -69],
              [112, 0, -69]
            ]
          },
          {
            type: "cell",
            name: "贵宾休息室",
            routePoint: 304,
            color: 1,
            points: [
              [89, 0, -62],
              [98, 0, -62],
              [98, 0, -56],
              [89, 0, -56]
            ]
          },
          {
            type: "cell",
            name: "贵宾接待厅",
            routePoint: 304,
            color: 2,
            points: [
              [89, 0, -56],
              [98, 0, -56],
              [98, 0, -48],
              [89, 0, -48]
            ]
          },
          {
            type: "cell",
            name: "舞美",
            routePoint: 304,
            color: 2,
            points: [
              [125, 0, -62],
              [134, 0, -62],
              [134, 0, -60],
              [135, 0, -60],
              [135, 0, -54],
              [125, 0, -54]
            ]
          },
          {
            type: "cell",
            name: "化妆室",
            routePoint: 304,
            color: 2,
            points: [
              [133, 0, -95],
              [142, 0, -95],
              [142, 0, -66],
              [133, 0, -66]
            ]
          },
          {
            type: "cell",
            name: "服装间",
            routePoint: 304,
            color: 2,
            points: [
              [128, 0, -101],
              [130, 0, -101],
              [130, 0, -96],
              [128, 0, -96]
            ]
          },
          // 走廊
          {
            type: "gallery",
            name: "走廊-培训厅旁边",
            routePoint: 304,
            color: 2,
            points: [
              [-90, 0, -131],
              [-85, 0, -131],
              [-85, 0, -118],
              [-54, 0, -118],
              [-54, 0, -131],
              [-49, 0, -131],
              [-49, 0, -116],
              [-27, 0, -116],
              [-27, 0, -102],
              [-31, 0, -102],
              [-31, 0, -114],
              [-49, 0, -114],
              [-49, 0, -102],
              [-54, 0, -102],
              [-54, 0, -116],
              [-83, 0, -116],
              [-83, 0, -98],
              [-85, 0, -98],
              [-85, 0, -66],
              [-90, 0, -66]
            ]
          },
          {
            type: "gallery",
            name: "走廊-小型普通教室",
            routePoint: 304,
            color: 2,
            points: [
              [-85, 0, -78],
              [-49, 0, -78],
              [-49, 0, -75],
              [-85, 0, -75]
            ]
          },
          {
            type: "gallery",
            name: "走廊-小型普通教室",
            routePoint: 304,
            color: 2,
            points: [
              [-58, 0, -75],
              [-53, 0, -75],
              [-53, 0, -60],
              [-58, 0, -60]
            ]
          },
          {
            type: "gallery",
            name: "走廊-中型普通教室",
            routePoint: 304,
            color: 2,
            points: [
              [-63, 0, -60],
              [-31, 0, -60],
              [-31, 0, -48],
              [-36, 0, -48],
              [-36, 0, -57],
              [-63, 0, -57]
            ]
          },
          {
            type: "gallery",
            name: "走廊-小型普通教室",
            routePoint: 304,
            color: 2,
            points: [
              [-53, 0, -102],
              [-53, 0, -93],
              [-66, 0, -93],
              [-66, 0, -78],
              [-64, 0, -78],
              [-64, 0, -91],
              [-36, 0, -91],
              [-36, 0, -71],
              [-30, 0, -71],
              [-30, 0, -55],
              [-8, 0, -55],
              [-8, 0, -57],
              [-28, 0, -57],
              [-28, 0, -73],
              [-33, 0, -73],
              [-33, 0, -78],
              [-31, 0, -78],
              [-31, 0, -86],
              [-33, 0, -86],
              [-33, 0, -91],
              [-28, 0, -91],
              [-28, 0, -102],
              [-30, 0, -102],
              [-30, 0, -93],
              [-50, 0, -93],
              [-50, 0, -102]
            ]
          },
          {
            type: "gallery",
            name: "走廊-门楼",
            routePoint: 304,
            color: 2,
            points: [
              [8, 0, -57],
              [27, 0, -57],
              [27, 0, -73],
              [33, 0, -73],
              [33, 0, -78],
              [31, 0, -78],
              [31, 0, -86],
              [33, 0, -86],
              [33, 0, -91],
              [27, 0, -91],
              [27, 0, -102],
              [30, 0, -102],
              [30, 0, -93],
              [35, 0, -93],
              [35, 0, -71],
              [30, 0, -71],
              [30, 0, -55],
              [8, 0, -55]
            ]
          },
          {
            type: "gallery",
            name: "走廊-右边",
            routePoint: 304,
            color: 2,
            points: [
              [30, 0, -62],
              [68, 0, -62],
              [68, 0, -74],
              [70, 0, -74],
              [70, 0, -66],
              [73, 0, -66],
              [73, 0, -65],
              [130, 0, -65],
              [130, 0, -101],
              [133, 0, -101],
              [133, 0, -62],
              [70, 0, -62],
              [70, 0, -29],
              [72, 0, -29],
              [72, 0, -17],
              [66, 0, -17],
              [66, 0, -29],
              [68, 0, -29],
              [68, 0, -57],
              [62, 0, -57],
              [62, 0, -59],
              [30, 0, -59]
            ]
          }
        ]
      },
      labelArray: [
        // 卫生间图片
        { text: "img:./images/cisuo.png", position: [-119, 8, -72], type: 2 }, // 公共卫生间
        { text: "img:./images/cisuo.png", position: [14, 8, -121], type: 1 }, // 展厅卫生间
        { text: "img:./images/cisuo.png", position: [-14, 8, -121], type: 1 }, // 展厅卫生间
        { text: "img:./images/cisuo.png", position: [-56, 8, -125], type: 1 }, // 电子阅览卫生间
        { text: "img:./images/cisuo.png", position: [-63, 8, -70], type: 1 }, // 小型普通教室卫生间
        { text: "img:./images/cisuo.png", position: [79, 8, -125], type: 1 }, // 舞蹈戏曲排练厅（中型）卫生间
        { text: "img:./images/cisuo.png", position: [76, 8, -92], type: 2 }, // 剧场卫生间
        { text: "img:./images/cisuo.png", position: [76, 8, -71], type: 2 }, // 剧场卫生间
        { text: "img:./images/cisuo.png", position: [113, 8, -60], type: 2 }, // 贵宾接待厅卫生间
        { text: "img:./images/cisuo.png", position: [124, 8, -60], type: 2 }, // 贵宾接待厅卫生间
        { text: "img:./images/cisuo.png", position: [135, 8, -102], type: 2 }, // 卫生间-化装室
        { text: "img:./images/louti.png", position: [93, 8, -98], type: 2 }, // 楼梯-观众厅
        { text: "img:./images/louti.png", position: [105, 8, -98], type: 2 }, // 楼梯-观众厅
        { text: "img:./images/louti.png", position: [93, 8, -66], type: 2 }, // 楼梯-观众厅
        { text: "img:./images/louti.png", position: [105, 8, -66], type: 2 }, // 楼梯-观众厅
        { text: "img:./images/louti.png", position: [138, 8, -102], type: 2 }, // 楼梯-化装室
        { text: "img:./images/louti.png", position: [138, 8, -63], type: 2 }, // 楼梯-化装室
        // 楼梯图片
        { text: "img:./images/louti.png", position: [-87, 8, -128], type: 1 }, // 电子阅览电梯厅楼梯
        { text: "img:./images/louti.png", position: [-104, 8, -52], type: 1 }, // 人防楼梯
        { text: "img:./images/louti.png", position: [-31, 8, -45], type: 1 }, // 人防楼梯
        { text: "img:./images/louti.png", position: [-32, 8, -117], type: 1 }, // 保安站人防楼梯
        { text: "img:./images/louti.png", position: [-31, 8, -126], type: 1 }, // 保安站楼梯
        { text: "img:./images/louti.png", position: [87, 8, -127], type: 1 }, // 舞蹈戏曲排练厅（中型）楼梯
        { text: "img:./images/louti.png", position: [-52, 8, -70], type: 1 }, // 小型普通教室楼梯
        { text: "img:./images/louti.png", position: [-21, 8, -37], type: 2 }, // 广播站楼梯
        { text: "img:./images/louti.png", position: [-52, 8, -128], type: 1 }, // 电子阅览楼梯
        { text: "img:./images/louti.png", position: [20, 8, -37], type: 2 }, // 医疗室楼梯
        { text: "img:./images/louti.png", position: [56, 8, -54], type: 2 }, // 门厅楼梯
        { text: "img:./images/louti.png", position: [64, 8, -93], type: 2 }, // 采光井上空楼梯
        { text: "img:./images/louti.png", position: [64, 8, -70], type: 2 }, // 采光井上空楼梯
        { text: "img:./images/louti.png", position: [106, 8, -60], type: 2 }, // 贵宾休息厅楼梯
        { text: "img:./images/louti.png", position: [-88, 8, -72], type: 1 }, // 电子阅览楼梯
        { text: "img:./images/louti.png", position: [63, 8, -105], type: 2 }, // 下沉庭院上空楼梯
        { text: "img:./images/louti.png", position: [-36, 8, -134], type: 2 }, // 前室楼梯
        { text: "img:./images/louti.png", position: [-33, 8, -54], type: 2 }, // 中型普通教室-楼梯
        // 电梯图片
        { text: "img:./images/dianti.png", position: [-84, 8, -120], type: 1 }, // 电子阅览电梯厅电梯
        { text: "img:./images/dianti.png", position: [-27, 8, -39], type: 2 }, // 广播站电梯
        { text: "img:./images/dianti.png", position: [-30, 8, -134], type: 2 }, // 前室电梯
        { text: "img:./images/dianti.png", position: [26, 8, -39], type: 2 }, // 医疗室电梯
        { text: "img:./images/dianti.png", position: [60, 8, -54], type: 2 }, // 门厅电梯
        { text: "img:./images/dianti.png", position: [102, 8, -60], type: 2 }, // 贵宾休息厅电梯
        // 走廊游廊
        { text: "游廊", position: [-50, 8, -90], type: 2 }, // 游廊-庭院
        { text: "游廊", position: [-33, 8, -80], type: 2 }, // 游廊-庭院
        { text: "游廊", position: [33, 8, -80], type: 2 }, // 游廊-庭院
        { text: "游廊", position: [51, 8, -59], type: 2 }, // 游廊-庭院
        { text: "门廊", position: [69, 8, -22], type: 2 }, // 游廊-庭院
        { text: "走廊", position: [-74, 8, -75], type: 2 }, // 走廊-庭院
        { text: "走廊", position: [-86, 8, -102], type: 2 }, // 走廊-培训厅
        // 左边文字
        { text: "培训门厅", position: [-96, 8, -118], type: 3 },
        { text: "电子阅览", position: [-71, 8, -123], type: 2 },
        { text: "报告厅", position: [-96, 8, -92], type: 2 },
        // {text:"休息室",position:[-98,8,-82],type:2}, // 报告厅的休息室
        { text: "庭院", position: [-73, 8, -93], type: 2 },
        // {text:"亭子",position:[-64,8,-104],type:2}, // 庭院亭子
        { text: "小型普通教室", position: [-76, 8, -69], type: 2 },
        { text: "中型普通教室", position: [-49, 8, -53], type: 2 },
        { text: "广播站", position: [-25, 8, -35], type: 1 },
        { text: "前室", position: [-31, 8, -137], type: 1 },
        { text: "保安站", position: [-31, 8, -122], type: 1 },
        { text: "小型阶梯教室", position: [-40, 8, -107], type: 1 },
        { text: "庭院", position: [-40, 8, -96], type: 1 }, // 庭院-小型阶梯教室
        { text: "庭院", position: [-44, 8, -80], type: 1 }, // 庭院-小型阶梯教室
        // 中间文字
        { text: "展厅", position: [0, 8, -111], type: 1 },
        { text: "庭院", position: [0, 8, -77], type: 1 }, // 展厅庭院
        { text: "门厅", position: [46, 8, -52], type: 1 },
        { text: "门楼", position: [0, 8, -55], type: 1 },
        // 右边文字
        // {text:"直线坡段",position:[32,3.2,-124],type:1},
        { text: "档案库房", position: [40, 8, -108], type: 1 },
        { text: "庭院", position: [47, 8, -82], type: 1 }, // 档案库房庭院
        { text: "医疗室", position: [24, 8, -34], type: 1 },
        { text: "舞蹈戏曲排练厅（中型）", position: [64, 8, -123], type: 1 },
        { text: "舞蹈戏曲排练厅（小型）", position: [88, 8, -108], type: 1 },
        { text: "休息室", position: [91, 8, -117], type: 1 }, // 休息室-舞蹈戏曲排练厅（小型）
        { text: "器材储藏", position: [91, 8, -122], type: 1 }, // // 器材储藏-舞蹈戏曲排练厅（小型）
        { text: "剧场前厅", position: [71, 8, -80], type: 1 },
        { text: "观众厅", position: [93, 8, -82], type: 1 },
        { text: "舞台", position: [121, 8, -81], type: 1 },
        { text: "贵宾休息厅", position: [94, 8, -58], type: 1 },
        { text: "贵宾接待厅", position: [94, 8, -51], type: 1 },
        { text: "贵宾门廊", position: [92, 8, -42], type: 1 },
        { text: "舞美", position: [130, 8, -57], type: 1 },
        { text: "化妆室", position: [138, 8, -83], type: 1 },
        { text: "服装间", position: [129, 8, -99], type: 1 }
      ]
    },
    "B1": {
      labelArray: [
        { text: "办公室", position: [18.86, 10.1, -33.918], type: 1 },
        {
          text: "img:./images/dianti.png",
          position: [5.378, 8, -24.877],
          type: 1
        },
        {
          text: "img:./images/louti.png",
          position: [19.075, 8, -42.134],
          type: 1
        },
        { text: "小卖部", position: [31.726, 12.1, -35.783] },
        { text: "办公室", position: [31.726, 10.1, -30.59], type: 1 },
        {
          text: "img:./images/cisuo.png",
          position: [42.778, 8, -35.443],
          type: 1
        },
        {
          text: "img:./images/dianti.png",
          position: [35.357, 8, -43.612],
          type: 1
        },
        { text: "办公室", position: [42.478, 10.1, -47.262], type: 1 },
        {
          text: "img:./images/dianti.png",
          position: [81.637, 8, -50.491],
          type: 1
        },
        {
          text: "img:./images/cisuo.png",
          position: [94.271, 8, -49.355],
          type: 1
        },
        {
          text: "img:./images/louti.png",
          position: [-113.211, 8, -121.504],
          type: 1
        },
        {
          text: "img:./images/dianti.png",
          position: [-111.078, 8, -115.611],
          type: 1
        },
        {
          text: "img:./images/cisuo.png",
          position: [-106.515, 8, -122.834],
          type: 1
        },
        {
          text: "img:./images/cisuo.png",
          position: [-104.303, 8, -114.489],
          type: 1
        },
        { text: "舞蹈戏曲排练厅(大型)", position: [23.599, 10.1, -108.111] },
        { text: "舞蹈戏曲排练厅(中型)", position: [50.01, 10.1, -115.088] },
        { text: "庭院", position: [49.258, 10.1, -96.322] },
        {
          text: "img:./images/dianti.png",
          position: [66.481, 8, -110.532],
          type: 1
        },
        {
          text: "img:./images/cisuo.png",
          position: [89.489, 8, -95.779],
          type: 1
        },
        { text: "存储间", position: [98.245, 10.1, -96.36] },
        { text: "侧舞台", position: [100.245, 10.1, -90.36] },
        { text: "侧舞台", position: [101.078, 10.1, -57.229] },
        { text: "主舞台", position: [100.769, 10.1, -73.377] },
        {
          text: "img:./images/cisuo.png",
          position: [110.032, 8, -93.609],
          type: 1
        },
        { text: "候场区", position: [110.74, 10.1, -86.338] },
        { text: "化妆间", position: [119.83, 10.1, -74.94] },
        { text: "门廊值班室", position: [113.988, 12.1, -46.236] },
        { text: "过道", position: [-82.997, 16.1, -75.285] },
        {
          text: "img:./images/park.svg",
          position: [-110.053, 8, -55.87],
          type: 1
        },
        {
          text: "img:./images/park.svg",
          position: [-90.053, 8, -55.87],
          type: 1
        },
        {
          text: "img:./images/park.svg",
          position: [-74.053, 8, -55.87],
          type: 1
        },
        {
          text: "img:./images/park.svg",
          position: [-60.053, 8, -55.87],
          type: 1
        },
        {
          text: "img:./images/park.svg",
          position: [-45.053, 8, -55.87],
          type: 1
        },
        {
          text: "img:./images/park.svg",
          position: [-30.053, 8, -55.87],
          type: 1
        },
        { text: "通道", position: [-45.863, 10.1, -101.285] },
        { text: "通道", position: [-60.863, 10.1, -101.285] },
        { text: "通道", position: [-74.863, 10.1, -101.285] },
        {
          text: "img:./images/park.svg",
          position: [-80.863, 8, -90.285],
          type: 1
        },
        {
          text: "img:./images/park.svg",
          position: [-52.863, 8, -90.285],
          type: 1
        },
        {
          text: "img:./images/park.svg",
          position: [-66.863, 8, -90.285],
          type: 1
        },
        { text: "服务大厅", position: [22.618, 10.1, -49.701] },
        { text: "备用机房", position: [15.306, 10.1, -12.007] },
        { text: "消防水池", position: [41.472, 10.1, -21.903] },
        { text: "空调机房", position: [74.961, 10.1, -21.45] },
        {
          text: "img:./images/louti.png",
          position: [110.593, 8, -21.347],
          type: 1
        },
        { text: "空调机房", position: [50.168, 10.1, -74.389] },
        { text: "实验室剧场", position: [20.648, 12.1, -82.107] },
        { text: "实验室剧场", position: [21.196, 12.1, -60.376] },
        { text: "小型化妆室", position: [21.857, 10.1, -70.59] },
        { text: "实验室剧场", position: [37.147, 10.1, -68.491] },
        { text: "汽车坡道", position: [5.847, 10.1, -114.122] },
        { text: "走廊", position: [4.172, 7.1, -48.341] },
        { text: "走廊", position: [4.629, 7.1, -20.0] },
        { text: "走廊", position: [21.63, 7.1, -26.223] },
        {
          text: "img:./images/louti.png",
          position: [40.313, 12, -56.326],
          type: 1
        },
        { text: "走廊", position: [33.34, 12.1, -100.293] },
        { text: "走廊", position: [33.34, 7.1, -86.293] },
        { text: "走廊", position: [33.34, 7.1, -56.293] },
        { text: "走廊", position: [48.34, 12.1, -38.293] },
        { text: "练琴房", position: [18.34, 12.1, -124.293] },
        { text: "非机动车库", position: [-118.34, 12.1, -90.293] },
        {
          text: "img:./images/louti.png",
          position: [30.34, 12.1, -120.293],
          type: 1
        }
      ],
      floorInfo: {
        buildingId: "b1",
        buildingName: "测试楼层",
        center: [0, 0, 0],
        buildingItem: [
          {
            type: "floor",
            name: "地板",
            points: [
              [119.713, 0, 0.562],
              [104.288, 0, 0.562],
              [104.012, 0, -3.566],
              [94.923, 0, -4.117],
              [91.893, 0, -34.395],
              [102.36, 0, -34.12],
              [102.36, 0, -36.322],
              [89.689, 0, -36.597],
              [89.414, 0, 0.562],
              [72.336, 0, 0.287],
              [71.785, 0, 5.517],
              [25.51, 0, 5.517],
              [25.234, 0, 1.113],
              [11.186, 0, 1.388],
              [10.635, 0, -21.458],
              [-2.862, 0, -21.458],
              [-2.837, 0, -28.517],
              [11.186, 0, -28.266],
              [11.737, 0, -44.854],
              [0.444, 0, -45.13],
              [0.444, 0, -31.642],
              [-39.221, 0, -31.642],
              [-39.496, 0, -20.632],
              [-53.819, 0, -20.907],
              [-53.813, 0, -30.817],
              [-123.508, 0, -31.092],
              [-129.017, 0, -37.698],
              [-132.598, 0, -37.698],
              [-132.047, 0, -50.084],
              [-130.17, 0, -50.078],
              [-129.764, 0, -71.993],
              [-137.253, 0, -72.434],
              [-146.944, 0, -79.917],
              [-146.944, 0, -130.541],
              [1.069, 0, -131.421],
              [0.188, 0, -58.347],
              [14.285, 0, -58.347],
              [14.725, 0, -86.96],
              [11.641, 0, -87.401],
              [11.641, 0, -131.861],
              [78.159, 0, -131.421],
              [79.04, 0, -103.688],
              [120.008, 0, -103.248],
              [128.378, 0, -93.123],
              [129.259, 0, -35.896],
              [118.246, 0, -36.337],
              [118.246, 0, -31.935],
              [124.854, 0, -28.413],
              [123.973, 0, -11.245],
              [119.713, 0, 0.562],
              [120.008, 0, -6.843]
            ]
          },
          {
            type: "cell",
            name: "A区",
            routePoint: 0,
            color: 2,
            points: [
              [113.855, 0, -1.764],
              [106.578, 0, -1.867],
              [106.578, 0, -5.994],
              [99.146, 0, -6.324],
              [95.512, 0, -32.733],
              [106.578, 0, -32.898],
              [106.578, 0, -37.024],
              [106.578, 0, -37.024],
              [113.681, 0, -36.859],
              [113.516, 0, -30.917],
              [117.15, 0, -28.441],
              [117.48, 0, -10.78],
              [113.846, 0, -8.965]
            ]
          },
          {
            type: "cell",
            name: "办公室",
            routePoint: 1,
            color: 0,
            points: [
              [18.452, 0, -26.594],
              [13.341, 0, -26.567],
              [13.861, 0, -42.986],
              [18.452, 0, -43.165]
            ]
          },
          {
            type: "cell",
            name: "办公室",
            routePoint: 2,
            color: 0,
            points: [
              [65.583, 0, -28.84],
              [25.882, 0, -28.84],
              [25.882, 0, -38.216],
              [65.763, 0, -38.216]
            ]
          },
          {
            type: "cell",
            name: "办公室",
            routePoint: 3,
            color: 0,
            points: [
              [74.92, 0, -40.981],
              [34.198, 0, -41.17],
              [34.387, 0, -48.726],
              [36.845, 0, -48.849],
              [36.845, 0, -56.306],
              [50.08, 0, -56.439],
              [50.269, 0, -54.961],
              [74.92, 0, -54.583]
            ]
          },
          {
            type: "cell",
            name: "值班室",
            routePoint: 4,
            color: 0,
            points: [
              [117.461, 0, -41.847],
              [90.141, 0, -41.925],
              [90.017, 0, -44.718],
              [85.38, 0, -44.718],
              [85.38, 0, -43.591],
              [87.385, 0, -43.591],
              [87.51, 0, -40.962],
              [78.113, 0, -41.087],
              [78.113, 0, -48.724],
              [79.616, 0, -48.599],
              [79.836, 0, -52.355],
              [88.137, 0, -52.48],
              [88.262, 0, -47.347],
              [89.766, 0, -47.222],
              [90.017, 0, -52.355],
              [113.573, 0, -52.355],
              [113.573, 0, -50.727],
              [117.207, 0, -50.602]
            ]
          },
          {
            type: "cell",
            name: "化妆室",
            routePoint: -1,
            color: 2,
            points: [
              [120.924, 0, -54.003],
              [114.803, 0, -54.136],
              [114.404, 0, -94.872],
              [119.859, 0, -94.739],
              [119.992, 0, -91.282],
              [124.65, 0, -91.282],
              [124.916, 0, -52.184],
              [121.057, 0, -51.795]
            ]
          },
          {
            type: "cell",
            name: "主舞台",
            routePoint: 5,
            color: 2,
            points: [
              [110.198, 0, -54.1],
              [91.368, 0, -54.1],
              [91.368, 0, -91.026],
              [88.698, 0, -91.166],
              [88.839, 0, -96.642],
              [90.525, 0, -96.642],
              [90.104, 0, -100.573],
              [112.586, 0, -100.713],
              [112.727, 0, -93.834],
              [110.057, 0, -93.834],
              [109.917, 0, -86.252],
              [112.868, 0, -85.409],
              [112.868, 0, -57.329],
              [110.057, 0, -57.329]
            ]
          },
          {
            type: "cell",
            name: "舞台",
            routePoint: 5,
            color: 2,
            points: [
              [89.884, 0, -63.683],
              [79.487, 0, -59.61],
              [59.992, 0, -59.728],
              [59.874, 0, -84.578],
              [80.019, 0, -84.342],
              [89.943, 0, -80.387]
            ]
          },
          {
            type: "cell",
            name: "庭院",
            routePoint: 6,
            color: 1,
            points: [
              [76.214, 0, -92.501],
              [36.985, 0, -92.501],
              [37.292, 0, -102.368],
              [76.754, 0, -102.215]
            ]
          },
          {
            type: "cell",
            name: "舞蹈戏曲排练厅(大型)",
            routePoint: 7,
            color: 1,
            points: [
              [28.31, 0, -92.318],
              [14.45, 0, -92.655],
              [14.91, 0, -119.307],
              [28.773, 0, -119.154]
            ]
          },
          {
            type: "cell",
            name: "舞蹈戏曲排练厅(中型)",
            routePoint: 8,
            color: 1,
            points: [
              [63.815, 0, -107.128],
              [37.291, 0, -107.822],
              [37.291, 0, -121.803],
              [63.968, 0, -120.996]
            ]
          },
          {
            type: "cell",
            name: "车库洗手间",
            routePoint: 9,
            color: 2,
            points: [
              [-99.698, 0, -107.138],
              [-112.441, 0, -107.237],
              [-112.441, 0, -107.237],
              [-112.441, 0, -107.237],
              [-112.441, 0, -113.504],
              [-117.817, 0, -113.504],
              [-117.718, 0, -120.467],
              [-115.826, 0, -120.467],
              [-115.726, 0, -125.938],
              [-106.07, 0, -125.839],
              [-106.219, 0, -118.708],
              [-101.268, 0, -118.708],
              [-101.427, 0, -115.676],
              [-96.795, 0, -115.357],
              [-96.795, 0, -109.452],
              [-99.67, 0, -109.612]
            ]
          },
          {
            type: "cell",
            name: "值班室",
            routePoint: 4,
            color: 2,
            points: [
              [116.103, 2, -42.309],
              [112.675, 2, -42.523],
              [112.814, 2, -49.947],
              [115.996, 2, -49.482]
            ]
          },
          {
            type: "gallery",
            name: "过道",
            routePoint: -1,
            color: 2,
            points: [
              [-5.863, 0, -75.58],
              [-136.738, 0, -75.024],
              [-136.923, 0, -82.178],
              [-5.863, 0, -82.066]
            ]
          },
          {
            type: "gallery",
            name: "过道",
            routePoint: -1,
            color: 2,
            points: [
              [-99.991, 0, -33.53],
              [-104.192, 0, -33.649],
              [-104.152, 0, -75.97],
              [-100.232, 0, -75.97]
            ]
          },
          {
            type: "gallery",
            name: "过道",
            routePoint: -1,
            color: 2,
            points: [
              [-80.991, 0, -33.53],
              [-85.192, 0, -33.649],
              [-85.152, 0, -75.97],
              [-81.232, 0, -75.97]
            ]
          },
          {
            type: "gallery",
            name: "过道",
            routePoint: -1,
            color: 2,
            points: [
              [-65.991, 0, -33.53],
              [-70.192, 0, -33.649],
              [-70.152, 0, -75.97],
              [-66.232, 0, -75.97]
            ]
          },
          {
            type: "gallery",
            name: "过道",
            routePoint: -1,
            color: 2,
            points: [
              [-50.991, 0, -33.53],
              [-55.192, 0, -33.649],
              [-55.152, 0, -75.97],
              [-51.232, 0, -75.97]
            ]
          },
          {
            type: "gallery",
            name: "过道",
            routePoint: -1,
            color: 2,
            points: [
              [-35.991, 0, -33.53],
              [-40.192, 0, -33.649],
              [-40.152, 0, -75.97],
              [-36.232, 0, -75.97]
            ]
          },
          {
            type: "gallery",
            name: "过道",
            routePoint: -1,
            color: 2,
            points: [
              [-20.991, 0, -33.53],
              [-25.192, 0, -33.649],
              [-25.152, 0, -75.97],
              [-21.232, 0, -75.97]
            ]
          },
          {
            type: "cell",
            name: "非机动车库",
            routePoint: -1,
            color: 2,
            points: [
              [-104.763, 0, -83.219],
              [-121.843, 0, -82.587],
              [-122.792, 0, -86.38],
              [-133.537, 0, -86.968],
              [-133.546, 0, -114.513],
              [-116.15, 0, -114.513],
              [-115.834, 0, -107.875],
              [-105.079, 0, -107.559]
            ]
          },
          {
            type: "gallery",
            name: "过道",
            routePoint: -1,
            color: 2,
            points: [
              [-45.344, 0, -81.804],
              [-50.949, 0, -81.804],
              [-50.278, 0, -104.666],
              [-44.855, 0, -104.478]
            ]
          },
          {
            type: "gallery",
            name: "过道",
            routePoint: -1,
            color: 2,
            points: [
              [-60.344, 0, -81.804],
              [-65.949, 0, -81.804],
              [-65.278, 0, -104.666],
              [-59.855, 0, -104.478]
            ]
          },
          {
            type: "gallery",
            name: "过道",
            routePoint: -1,
            color: 2,
            points: [
              [-75.344, 0, -81.804],
              [-80.949, 0, -81.804],
              [-80.278, 0, -104.666],
              [-74.855, 0, -104.478]
            ]
          },
          {
            type: "cell",
            name: "过道",
            routePoint: -1,
            color: 2,
            points: [
              [-1.928, 0, -86.941],
              [-34.474, 0, -86.941],
              [-34.689, 0, -82.862],
              [-40.059, 0, -82.647],
              [-40.274, 0, -105.831],
              [-43.066, 0, -109.48],
              [-50.37, 0, -110.124],
              [-50.585, 0, -106.046],
              [-61.821, 0, -105.958],
              [-61.832, 0, -116.697],
              [-57.667, 0, -116.844],
              [-57.319, 0, -125.532],
              [-6.639, 0, -125.532],
              [-6.986, 0, -113.616],
              [-2.0, 0, -113.575]
            ]
          },
          {
            type: "cell",
            name: "服务大厅",
            routePoint: 10,
            color: 0,
            points: [
              [29.239, 0, -44.902],
              [19.98, 0, -44.902],
              [19.851, 0, -49.098],
              [13.897, 0, -49.369],
              [13.868, 0, -55.089],
              [29.097, 0, -55.318]
            ]
          },
          {
            type: "cell",
            name: "备用机房",
            routePoint: -1,
            color: 2,
            points: [
              [18.67, 0, 0.0],
              [12.587, 0, 0.062],
              [12.438, 0, -20.19],
              [18.075, 0, -20.19]
            ]
          },
          {
            type: "cell",
            name: "消防",
            routePoint: 11,
            color: 2,
            points: [
              [61.513, 0, -2.555],
              [49.572, 0, -2.555],
              [49.572, 0, -16.578],
              [37.481, 0, -16.578],
              [37.481, 0, -5.091],
              [24.957, 0, -5.39],
              [24.659, 0, -26.064],
              [61.066, 0, -26.214]
            ]
          },
          {
            type: "cell",
            name: "空调设备",
            routePoint: -1,
            color: 2,
            points: [
              [84.115, 0, -2.257],
              [68.351, 0, -1.959],
              [68.351, 0, -38.063],
              [84.113, 0, -37.419]
            ]
          },
          {
            type: "cell",
            name: "空调机房",
            routePoint: -1,
            color: 2,
            points: [
              [59.932, 0, -59.514],
              [46.635, 0, -59.359],
              [46.6, 0, -85.302],
              [59.778, 0, -85.147]
            ]
          },
          {
            type: "cell",
            name: "实验室剧场",
            routePoint: 12,
            color: 2,
            points: [
              [46.149, 0, -59.962],
              [34.268, 0, -59.714],
              [34.011, 0, -82.985],
              [46.654, 0, -82.88]
            ]
          },
          {
            type: "cell",
            name: "小型化妆室与实验室剧场",
            routePoint: 12,
            color: 2,
            points: [
              [28.209, 0, -57.039],
              [15.74, 0, -57.039],
              [16.062, 0, -88.927],
              [28.048, 0, -88.766]
            ]
          },
          {
            type: "gallery",
            name: "走廊",
            routePoint: -1,
            color: 2,
            points: [
              [13.859, 0, -47.267],
              [-2.275, 0, -47.609],
              [-2.275, 0, -53.255],
              [13.973, 0, -53.026]
            ]
          },
          {
            type: "gallery",
            name: "走廊",
            routePoint: -1,
            color: 2,
            points: [
              [24.859, 0, -20.267],
              [-1.275, 0, -20.609],
              [-1.275, 0, -25.255],
              [24.973, 0, -25.026]
            ]
          },
          {
            type: "gallery",
            name: "走廊",
            routePoint: -1,
            color: 2,
            points: [
              [24.519, 0, -24.267],
              [20.201, 0, -24.267],
              [19.95, 0, -47.534],
              [24.768, 0, -47.398]
            ]
          },
          {
            type: "gallery",
            name: "走廊",
            routePoint: -1,
            color: 2,
            points: [
              //舞蹈大型旁
              [32.919, 0, -36.267],
              [29.201, 0, -36.267],
              [29.95, 0, -120.534],
              [32.968, 0, -120.398]
            ]
          },
          {
            type: "gallery",
            name: "走廊",
            routePoint: -1,
            color: 2,
            points: [
              //庭院旁
              [76.519, 0, -103.267],
              [30.201, 0, -103.267],
              [30.201, 0, -106.534],
              [76.768, 0, -106.398]
            ]
          },
          {
            type: "gallery",
            name: "走廊",
            routePoint: -1,
            color: 2,
            points: [
              //庭院旁
              [46.519, 0, -85.267],
              [30.201, 0, -85.267],
              [30.201, 0, -90.534],
              [46.768, 0, -90.398]
            ]
          },
          {
            type: "gallery",
            name: "走廊",
            routePoint: -1,
            color: 2,
            points: [
              //空调机房旁
              [92.519, 0, -87.267],
              [44.201, 0, -87.267],
              [44.201, 0, -90.534],
              [92.768, 0, -90.398]
            ]
          },
          {
            type: "gallery",
            name: "走廊",
            routePoint: -1,
            color: 2,
            points: [
              //空调机房旁
              [92.519, 0, -56.267],
              [30.201, 0, -56.267],
              [30.201, 0, -59.534],
              [92.768, 0, -59.398]
            ]
          },
          {
            type: "gallery",
            name: "走廊",
            routePoint: -1,
            color: 2,
            points: [
              //空调机房旁
              [120.519, 0, -38.267],
              [30.201, 0, -38.267],
              [30.201, 0, -40.534],
              [120.768, 0, -40.398]
            ]
          }
        ]
      }
    }
  },
  QYY: {
     "3F": {
         labelArray:
             [
                 // 楼梯
                 { text: "img:./images/louti.png", position: [0, 5.2, -39], type: 1 },

                 { text: "露台", position: [0, 3.2, -12], type: 4 },
                 { text: "二层上空", position: [0, 3.2, -25], type: 4 }
             ],
         floorInfo: {
             buildingId: "01", buildingName: "测试楼层", center: [120, 30, 6], buildingItem: [
                 {type: "floor", name: "地板", points: [[-9, 0, -42], [9, 0, -42], [9, 0, -41], [13, 0, -41], [13, 0, -10], [8, 0, -10], [8, 0, -9], [-8, 0, -9], [-8, 0, -10], [-13, 0, -10], [-13, 0, -41], [-9, 0, -41]] },
                 { type: "cell", name: "二层上空", routePoint: 19, color: 3, points: [[-8,0,-36],[8,0,-36],[8,0,-35],[9,0,-35],[9,0,-19],[8,0,-19],[8,0,-17],[-8,0,-17],[-8,0,-19],[-9,0,-19],[-9,0,-35],[-8,0,-35],]}
             ]
         }
     },
      "2F": {
          floorInfo: {
              buildingId:"01",buildingName:"测试楼层",center:[120,30,6],buildingItem: [
                  {type:"floor",name:"地板",points:[[0,0,-78],[33,0,-78],[33,0,-45],[10,0,-45],[10,0,-35],[-2,0,-35],[-2,0,3],[-41,0,3],[-41,0,-38],[-5,0,-38],[-5,0,-55],[0,0,-55]]},
                  // 左边
                  {type:"cell",name:"左边区域",routePoint:304,color:2,points:[[-37,0,-34],[-6,0,-34],[-6,0,0],[-18,0,0],[-18,0,-3],[-24,0,-3],[-24,0,0],[-37,0,-0]]},
                  {type:"cell",name:"池座上空",routePoint:304,color:1,points:[[-28,.1,-28],[-15,.1,-28],[-15,.1,-24],[-14,.1,-24],[-14,.1,-11],[-18,.1,-11],[-18,.1,-13],[-24,.1,-13],[-24,.1,-11],[-29,.1,-11],[-29,.1,-24],[-28,.1,-24],]},
                  // 右边
                  {type:"cell",name:"右边区域",routePoint:304,color:2,points:[[4,0,-75],[29,0,-75],[29,0,-49],[4,0,-49]]},
                  {type:"cell",name:"设备用房",routePoint:304,color:1,points:[[8,.1,-69],[25,.1,-69],[25,.1,-55],[24,.1,-55],[24,.1,-53],[9,.1,-53],[9,.1,-55],[8,.1,-55]]},
              ]
          },
          labelArray:  [
              // 楼梯图片
              {text:"img:./images/louti.png",position:[-32,8,-5],type:1}, // 左边疏散门厅
              {text:"img:./images/louti.png",position:[-10,8,-5],type:1}, // 左边疏散门厅
              {text:"img:./images/louti.png",position:[-34,8,-28],type:1}, // 左边上面
              {text:"img:./images/louti.png",position:[-15,8,-30],type:1}, // 左边上面
              {text:"img:./images/louti.png",position:[-10,8,-22],type:1}, // 左边上面
              {text:"img:./images/louti.png",position:[-33,8,-12],type:1}, // 左边西厢房
              {text:"img:./images/louti.png",position:[-9,8,-12],type:1}, // 左边东厢房
              {text:"img:./images/louti.png",position:[4,8,-72],type:1}, // 右边
              // 电梯
              {text:"img:./images/dianti.png",position:[-29,8,-30],type:1}, // 左边上面
              {text:"img:./images/dianti.png",position:[9,8,-73],type:1}, // 右边
              // 厕所
              {text:"img:./images/cisuo.png",position:[-10,8,-29],type:1},
              // 左边
              {text:"雅座",position:[-21,8,-11],type:4},
              {text:"西厢房",position:[-30,8,-9],type:4},
              {text:"东厢房",position:[-12,8,-9],type:4},
              {text:"疏散门厅",position:[-21,8,-7],type:4},
              {text:"池座上空",position:[-21,8,-20],type:4},
              // 右边
              {text:"检修马道",position:[19,8,-71],type:4},
              {text:"检修马道",position:[25,8,-64],type:4},
              {text:"检修马道",position:[5,8,-64],type:4},
              {text:"设备用房",position:[17,8,-52],type:4},
           ]
      },
      "1F": {
         labelArray: [
              // 楼梯图片
              { text: "img:./images/louti.png", position: [-19, 8, -14], type: 1 }, // 左边房间
              { text: "img:./images/louti.png", position: [19, 8, -14], type: 1 }, // 右边房间
              { text: "img:./images/louti.png", position: [-3, 8, -82], type: 1 }, // 中间屏风
              { text: "img:./images/louti.png", position: [3, 8, -82], type: 1 }, // 中间屏风
              { text: "img:./images/louti.png", position: [3, 8, -82], type: 1 }, // 中间屏风
              { text: "img:./images/louti.png", position: [-11, 8, -78], type: 1 }, // 中间化妆间
              { text: "img:./images/louti.png", position: [-9, 8, -53], type: 1 }, // 中间服务区
              { text: "img:./images/louti.png", position: [9, 8, -53], type: 1 }, // 中间服务区
              { text: "img:./images/louti.png", position: [0, 8, -45], type: 1 }, // 消防车道
              { text: "img:./images/louti.png", position: [-5, 8, -6], type: 1 }, // 静水池
              { text: "img:./images/louti.png", position: [5, 8, -6], type: 1 }, // 静水池
              { text: "img:./images/louti.png", position: [-9, 8, 4], type: 1 }, // 中间最下面
              { text: "img:./images/louti.png", position: [9, 8, 4], type: 1 }, // 中间最下面
              { text: "img:./images/louti.png", position: [36, 8, -38], type: 1 }, // 右边山门

              // 电梯图片
              { text: "img:./images/dianti.png", position: [-6, 8, -77], type: 1 }, // 中间化妆间

              // 厕所图片
              { text: "img:./images/cisuo.png", position: [11, 8, -78], type: 1 }, // 中间化妆间
              // 左边
              { text: "工作室", position: [-34, 8, -68], type: 4 },
              { text: "工作室", position: [-36, 8, -60], type: 4 },
              { text: "工作室", position: [-27, 8, -60], type: 4 },
              { text: "工作室", position: [-25, 8, -55], type: 4 },
              { text: "房间", position: [-20, 8, -17], type: 4 },
              { text: "假山", position: [-38, 8, -24], type: 4 },
              // 中间
              { text: "舞台上空", position: [0, 8, -88], type: 1 },
              { text: "屏风", position: [0, 8, -83], type: 1 },
              { text: "化妆间", position: [0, 8, -79], type: 1 },
              { text: "房间", position: [5, 8, -79], type: 1 },
              { text: "池座", position: [0, 8, -64], type: 1 },
              { text: "服务区", position: [0, 8, -58], type: 1 },
              { text: "消防车道", position: [0, 8, -35], type: 1 },
              { text: "静水池", position: [0, 8, -15], type: 1 },
              { text: "可移动屏风", position: [0, 8, -5], type: 1 },

              // 右边
              { text: "房间", position: [20, 8, -17], type: 4 },
              { text: "山门", position: [30, 8, -38], type: 4 },
              { text: "通往广府园", position: [33, 8, -17], type: 4 },
          ],
          floorInfo: {
              buildingId: "1f", buildingName: "1F", center: [0, 0, 0], buildingItem: [
                  {type: "floor", name: "地板", points: [[-10,0,-95],[10,0,-95],[10,0,-86],[18,0,-86],[18,0,-70],[28,0,-70],[28,0,-64],[34,0,-64],[34,0,-46],[41,0,-46],[41,0,-4],[14,0,-4],[14,0,9],[-14,0,9],[-14,0,-2],[-41,0,-2],[-41,0,-74],[-18,0,-74],[-18,0,-86],[-10,0,-86]]},
                  // 左边
                   { type: "cell", name: "工作室", routePoint: 304, color: 3, points: [[-35,0,-72], [-32,0,-72], [-32,0,-58], [-35,0,-58], [-35,0,-59], [-39,0,-59], [-39,0,-63], [-35,0,-63], [-35,0,-67], [-37,0,-67], [-37,0,-70], [-35,0,-70] ] },
                   { type: "cell", name: "工作室", routePoint: 304, color: 3, points: [[-30,0,-61],[-25,0,-61],[-25,0,-59],[-27,0,-59],[-27,0,-57],[-23,0,-57],[-23,0,-53],[-30,0,-53]]},
                   { type: "cell", name: "左边房间", routePoint: 304, color: 2, points: [[-24,0,-21],[-16,0,-21],[-16,0,-13],[-24,0,-13]]},
                   {type: "gallery", name: "左通道", routePoint: 304, color: 2, points: [[-32,0,-71],[-15,0,-71],[-15,0,-68],[-30,0,-68],[-30,0,-47],[-24,0,-41],[-24,0,-35],[-28,0,-30],[-28,0,-17],[-30,0,-17],[-30,0,-31],[-26,0,-36],[-26,0,-40],[-32,0,-46]]},
                   {type: "gallery", name: "左过道", routePoint: 304, color: 2, points: [[-36,0,-57],[-32,0,-57],[-32,0,-56],[-35,0,-56],[-38,0,-52],[-38,0,-49],[-35,0,-45],[-35,0,-36],[-30,0,-30],[-30,0,-28],[-36,0,-35],[-36,0,-44],[-39,0,-48],[-39,0,-53]]},

                    //中间
                   { type: "gallery", name: "中过道", routePoint: 304, color: 2, points: [[-15,0,-83],[15,0,-83],[15,0,-49],[-15,0,-49]]},
                   { type: "cell", name: "舞台上空", routePoint: 304, color: 1, points: [[-7,1,-91],[7,1,-91],[7,1,-86],[6,1,-86],[6,1,-83],[-6,1,-83],[-6,1,-86],[-7,1,-86]]},
                   { type: "cell", name: "化妆间-房间", routePoint: 304, color: 1, points: [[-4,1,-81],[6,1,-81],[6,1,-77],[-4,1,-77]]},
                   { type: "gallery", name: "消防车道", routePoint: 304, color: 1, points: [[-3,1,-40],[3,1,-40],[3,1,-31],[-3,1,-31]]},
                   { type: "cell", name: "可移动屏风", routePoint: 304, color: 1, points: [[-4,1,-10],[4,1,-10],[4,1,-8],[6,1,-8],[6,1,-1],[4,1,-1],[4,1,0],[-4,1,0],[-4,1,-1],[-6,1,-1],[-6,1,-8],[-4,1,-8],]},

                    //右边
                   { type: "cell", name: "右边房间", routePoint: 304, color: 2, points: [[24,0,-21],[16,0,-21],[16,0,-13],[24,0,-13]]},
                   {type: "gallery", name: "右通道", routePoint: 304, color: 2, points: [[15,0,-68],[26,0,-68],[26,0,-62],[30,0,-62],[30,0,-44],[33,0,-44],[33,0,-32],[30,0,-32],[30,0,-18],[35,0,-18],[35,0,-16],[28,0,-16],[28,0,-32],[26,0,-32],[26,0,-44],[28,0,-44],[28,0,-59],[24,0,-59],[24,0,-65],[15,0,-65],]}
          ]}
      },
      "B1": {
        labelArray: [
              { text: "img:./images/louti.png", position: [-21, 8, -15], type: 1 },
              { text: "img:./images/louti.png", position: [-17, 8, -19], type: 1 },
              { text: "img:./images/louti.png", position: [-13, 8, -78], type: 1 },
              { text: "img:./images/louti.png", position: [3, 8, -79], type: 1 },
              { text: "img:./images/louti.png", position: [-3, 8, -79], type: 1 },
              { text: "img:./images/louti.png", position: [9, 8, -53], type: 1 },
              { text: "img:./images/louti.png", position: [-9, 8, -53], type: 1 },
              { text: "img:./images/louti.png", position: [-5, 8, -4], type: 1 },
              { text: "img:./images/louti.png", position: [5, 8, -4], type: 1 },
              { text: "img:./images/louti.png", position: [19, 8, -19], type: 1 },
              { text: "img:./images/louti.png", position: [21, 8, -13], type: 1 },
              // 电梯
              { text: "img:./images/dianti.png", position: [-7, 8, -79], type: 1 },
              // 厕所
              { text: "img:./images/cisuo.png", position: [-18, 8, -25], type: 1 },
              { text: "img:./images/cisuo.png", position: [11, 8, -77], type: 1 },
              // 左边
              { text: " 通往地下车库", position: [-27, 8, -62], type: 4 },
              // 中间
              { text: "舞台", position: [0, 8, -87], type: 4 },
              { text: "配乐区", position: [0, 8, -81], type: 4 },
              { text: "展览区", position: [0, 3.2, -64], type: 4 },
              { text: "扮戏房", position: [0, 8, -78], type: 4 },
              { text: "后勤入口", position: [12, 8, -71], type: 4 },
              { text: "后勤入口", position: [-12, 8, -71], type: 4 },
              { text: "值班室", position: [-12, 8, -69], type: 4 },
              { text: "道具间", position: [-5, 8, -69], type: 4 },
              { text: "扮戏房", position: [0, 8, -69], type: 4 },
              { text: "服装间", position: [5, 8, -69], type: 4 },
              { text: "空调机房", position: [12, 8, -69], type: 4 },
              { text: "静水浅池", position: [0, 8, -13], type: 4 },
              { text: "高净空候场厅", position: [0, 8, -4], type: 4 },
              // 右边
              { text: "VRV空调外机", position: [20, 8, -65], type: 4 },
              { text: "假山", position: [20, 8, -60], type: 4 },
              { text: "排风井", position: [19, 8, -52], type: 4 },
              { text: "消防控制室", position: [15, 8, -24], type: 4 },
              { text: "弱电间", position: [19, 8, -25], type: 4 },
              { text: "辅助用房", position: [21, 8, -23], type: 4 },
        ],
        floorInfo: {
          buildingId: "B1", buildingName: "负一层", center: [0, 0, 0], buildingItem: [
              { type: "floor", name: "地板", points: [[-9, 0, -94], [9, 0, -94], [9, 0, -84], [17, 0, -84], [17, 0, -71], [20, 0, -71], [20, 0, -67], [25, 0, -67], [25, 0, -63], [33, 0, -63], [33, 0, -43], [17, 0, -43], [17, 0, -28], [26, 0, -28], [26, 0, -11], [8, 0, -11], [8, 0, 2], [-8, 0, 2], [-8, 0, -10], [-26, 0, -10], [-26, 0, -10], [-26, 0, -14], [-3, 0, -14], [-34, 0, -14], [-34, 0, -24], [-37, 0, -24], [-37, 0, -41], [-41, 0, -41], [-41, 0, -71], [-17, 0, -71], [-17, 0, -84], [-9, 0, -84]] },
              // 左边
              { type: "gallery", name: "通往地下车库", routePoint: 304, color: 2, points: [[-38, 0, -68], [-23, 0, -68], [-23, 0, -68], [-22.14286660120524, 0, -67.95507954201983],
                  [-21.295124135294373, 0, -67.8208103260172], [-20.46606064612543, 0, -67.59866343362026], [-19.66475952677844, 0, -67.29107275266932], [-18.9, 0, -66.9014083110324],
                  [-18.18016093120172, 0, -66.43393935387456], [-17.513129027857364, 0, -65.89378756891463], [-16.90621243108537, 0, -65.28687097214264], [-16.366060646125433, 0, -64.61983906879827],
                  [-15.898591688967603, 0, -63.89999999999999], [-15.508927247330673, 0, -63.13524047322156], [-15.20133656637974, 0, -62.33393935387457], [-14.979189673982795, 0, -61.504875864705625],
                  [-14.84492045798016, 0, -60.657133398794755], [-14.8, 0, -59.8], [-14.85, 0, -59], [-14.85, 0, -56], [-22, 0, -56], [-22.100668283189872, 0, -57.166969676937285],
                  [-22.254463623665337, 0, -57.56762023661078], [-22.449295844483803, 0, -57.949999999999996], [-22.683030323062717, 0, -58.309919534399135], [-22.953106215542682, 0, -58.64343548607132],
                  [-23.25656451392868, 0, -58.946893784457316], [-23.59008046560086, 0, -59.21696967693728], [-23.95, 0, -59.4507041555162], [-24.33237976338922, 0, -59.64553637633466],
                  [-24.733030323062717, 0, -59.79933171681013], [-25.147562067647186, 0, -59.9104051630086], [-25.57143330060262, 0, -59.97753977100992], [-26, 0, -59.99999999999999], [-26, 0, -60], [-38, 0, -60]]
              },
              { type: "cell", name: "左房间", routePoint: 304, color: 2, points: [[-22, 0, -26], [-13, 0, -26], [-13, 0, -22], [-18, 0, -22], [-18, 0, -19], [-16, 0, -19], [-16, 0, -14], [-18, 0, -14], [-18, 0, -13], [-22, 0, -13], [-22, 0, -14], [-24, 0, -14], [-24, 0, -19], [-22, 0, -19],] },
              // 中间
              { type: "cell", name: "展览区", routePoint: 304, color: 2, points: [[-7, 0, -91], [7, 0, -91], [7, 0, -86], [6, 0, -86], [6, 0, -81], [14, 0, -81], [14, 0, -51], [-14, 0, -51], [-14, 0, -81], [-6, 0, -81], [-6, 0, -86], [-7, 0, -86],] },
              { type: "cell", name: "扮戏房", routePoint: 304, color: 1, points: [[-3, 0.3, -80], [3, 0.3, -80], [3, 0.3, -77], [-3, 0.3, -77]] },
              { type: "cell", name: "值班室", routePoint: 304, color: 1, points: [[-14, 0.3, -71], [-10, 0.3, -71], [-10, 0.3, -68], [-14, 0.3, -68]] },
              { type: "cell", name: "道具间-扮戏房-服装间", routePoint: 304, color: 1, points: [[-8, 0.3, -71], [8, 0.3, -71], [8, 0.3, -68], [-8, 0.3, -68]] },
              { type: "cell", name: "空调机房", routePoint: 304, color: 1, points: [[14, 0, -71], [10, 0, -71], [10, 0, -68], [14, 0, -68]] },
              { type: "cell", name: "舞台", routePoint: 304, color: 1, points: [[-7, 0.5, -91], [7, 0.5, -91], [7, 0.5, -86], [6, 0.5, -86], [6, 0.5, -83], [-6, 0.5, -83], [-6, 0.5, -86], [-7, 0.5, -86]] },
              { type: "cell", name: "高净空候场厅", routePoint: 304, color: 1, points: [[-3, 0, -9], [3, 0, -9], [3, 0, -7], [6, 0, -7], [6, 0, -1], [3, 0, -1], [3, 0, 0], [-3, 0, 0], [-3, 0, -1], [-6, 0, -1], [-6, 0, -7], [-3, 0, -7]] },
              // 右边
              { type: "cell", name: "右房间", routePoint: 304, color: 2, points: [[22, 0, -26], [13, 0, -26], [13, 0, -22], [18, 0, -22], [18, 0, -19], [16, 0, -19], [16, 0, -14], [18, 0, -14], [18, 0, -13], [22, 0, -13], [22, 0, -14], [24, 0, -14], [24, 0, -19], [22, 0, -19],] },
          ]
        }
      },
      "B2": {
        labelArray: [
              {text:"img:./images/louti.png",position:[-7,8,-56],type:1},
              {text:"img:./images/louti.png",position:[7,8,-56],type:1},
              {text:"img:./images/louti.png",position:[-20,8,-16],type:1},
              {text:"img:./images/louti.png",position:[-5,8,-5],type:1},
              {text:"img:./images/louti.png",position:[5,8,-5],type:1},
              {text:"img:./images/louti.png",position:[21,8,-16],type:1},
              {text:"img:./images/cisuo.png",position:[-15,8,-10],type:1},
              {text:"车库入口",position:[-20,8,-60],type:4},
              {text:"报警阀间",position:[-8,8,-50],type:4},
              {text:"储藏间",position:[10,8,-50],type:4},
              {text:"风机房",position:[23,8,-51],type:4},
              {text:"停车位",position:[-25,8,-33],type:4},
              {text:"停车位",position:[23,4,-36],type:4},
              {text:"停车位",position:[-8,4,-33],type:4},
              {text:"停车位",position:[8,4,-33],type:4},
              {text:"过道",position:[0,8,-45],type:4},
              {text:"过道",position:[17,8,-34],type:4},
              {text:"过道",position:[0,8,-23],type:4},
              {text:"过道",position:[-17,8,-36],type:4},
              {text:"房间",position:[-26,8,-14],type:4},
              {text:"设备间",position:[-23,8,-9],type:4},
              {text:"高净空候场厅",position:[0,8,-3],type:4},
              {text:"扮戏房",position:[-8,8,-5],type:4},
              {text:"扮戏房",position:[8,8,-5],type:4},
              {text:"名角扮戏房",position:[8,8,1],type:4},
              {text:"名角扮戏房",position:[-8,8,1],type:4},
              {text:"除尘滤毒器",position:[15,8,-16],type:4},
              {text:"设备间",position:[24,8,-13],type:4},
              {text:"前室",position:[24,8,-18],type:4},
              {text:"服装间",position:[11,8,-9],type:4},
              {text:"设备被用房",position:[18,8,-9],type:4},
              {text:"强电间",position:[24,8,-9],type:4}
        ],
        floorInfo: {
          buildingId:"01",buildingName:"测试楼层",center:[120,30,6],buildingItem:[
              {type:"floor",name:"地板",points:[[-33, 0, -70],[-23, 0, -70],[-22.163772293858774, 0, -69.95617516294618],[-18.336706473457927, 0, -69.82518080587045],[-17.52786404500042, 0, -69.60845213036123],[-16.7461068553936, 0, -69.3083636611408],[-16, 0, -68.92820323027551],[-15.297717981660213, 0, -68.47213595499957], [-14.646955149129134, 0, -67.94515860381915], [-14.054841396180848, 0, -67.35304485087087], [-13.52786404500042, 0, -66.70228201833979],[-13.07179676972449, 0, -66], [-12.691636338859194, 0, -65.25389314460641], [-12.39154786963877, 0, -64.47213595499957], [-12.174819194129554, 0, -63.66329352654208], [-12.043824837053814, 0, -62.83622770614123], [-12, 0, -62],[-12, 0, -57],[29, 0, -57],[29, 0, -5],[12, 0, -5],[12, 0, -5],[12, 0, 4],[-12, 0, 4],[-12, 0, -5],[-31, 0, -5],[-31, 0, -51],[-26, 0, -51],[-26,0,-57],[-25.62250092524069,0,-61.050000000000004],[-25.437172715193856,0,-60.68627290799562],[-25.290879586448902,0,-60.305166278062295],[-25.185224357138157,0,-59.910855594189265],[-25.121364608063736,0,-59.50766100674385],[-25.1,0,-53.1],[-25.121364608063736,0,-53.50766100674385], [-25.185224357138157,0,-53.910855594189265],[-25.290879586448902,0,-54.305166278062295],[-25.290879586448902,0,-54.305166278062295],[-25.437172715193856,0,-55.68627290799562],[-25.62250092524069,0,-55.050000000000004],[-25.844833721937704,0,-55.392362483940644],[-26.101735180638162,0,-55.70960936479955],[-26.390390635200454,0,-55.998264819361836],[-26.707637516059354,0,-56.2551662780623],[-27.05,0,-56.477499074759315],[-27.41372709200438,0,-56.66282728480614],[-27.794833721937707,0,-56.8091204135511],[-28.189144405810737,0,-56.91477564286184],[-28.592338993256153,0,-56.978635391936265],[-28.592338993256153,0,-56.978635391936265],[-28.189144405810737,0,-56.978635391936265],[-29,0,-57],[-33,0,-57]]},
              {type:"gallery",name:"车库入口",routePoint:304,color:2,points:[[-30,0,-67],[-23,0,-67],[-22.163772293858774,0,-66.95617516294618],[-21.336706473457927,0,-66.82518080587045],[-20.52786404500042,0,-66.60845213036123],[-19.7461068553936,0,-66.3083636611408],[-19,0,-65.92820323027551],[-18.297717981660213,0,-65.47213595499957],[-17.646955149129134,0,-64.94515860381915],[-17.054841396180848,0,-64.35304485087087],[-16.52786404500042,0,-63.70228201833979],[-16.07179676972449,0,-63],[-15.691636338859194,0,-62.25389314460641],[-15.39154786963877,0,-61.47213595499957],[-15.174819194129554,0,-60.66329352654208],[-15.043824837053814,0,-59.83622770614123],[-15,0,-49],[-22,0,-49],[-22.1,0,-56.1],[-22.121364608063736,0,-56.50766100674385],[-22.185224357138157,0,-56.910855594189265],[-22.290879586448902,0,-57.305166278062295],[-22.290879586448902,0,-57.305166278062295],[-22.437172715193856,0,-57.68627290799562],[-22.62250092524069,0,-58.050000000000004],[-22.844833721937704,0,-58.392362483940644],[-23.101735180638162,0,-58.70960936479955],[-23.390390635200454,0,-58.998264819361836],[-23.707637516059354,0,-59.2551662780623],[-24.05,0,-59.477499074759315],[-24.41372709200438,0,-59.66282728480614],[-24.794833721937707,0,-59.8091204135511],[-25.189144405810737,0,-59.91477564286184],[-25.592338993256153,0,-59.978635391936265],[-26,0,-60],[-30,0,-60]]},
              {type:"cell",name:"最上面的房间",routePoint:304,color:1,points:[[-15,0,-54],[26,0,-54],[26,0,-49],[-15,0,-49]]},
              {type:"cell",name:"过道",routePoint:304,color:2,points:[[-22,0,-49],[20,0,-49],[20,0,-26],[26,0,-26],[26,0,-20],[13,0,-20],[13,0,-13],[26,0,-13],[26,0,-12],[9,0,-12],[9,0,-10],[-9,0,-10],[-9,0,-12],[-24,0,-12],[-24,0,-13],[-19,0,-13],[-19,0,-14],[-19,0,-20,],[-28,0,-20],[-28,0,-23],[-22,0,-23]]},
              {type:"cell",name:"左边停车位",routePoint:304,color:3,points:[[-28,0,-48],[-22,0,-48],[-22,0,-23],[-28,0,-23]]},
              {type:"cell",name:"中间停车位",routePoint:500,color:3,points:[[-14,1,-42],[-3,0,-42],[-3,0,-26],[-14,0,-26]]},
              {type:"cell",name:"中间停车位",routePoint:304,color:3,points:[[3,1,-42],[14,0,-42],[14,0,-26],[3,0,-26]]},
              {type:"cell",name:"右停车位",routePoint:304,color:3,points:[[20,0,-49],[26,0,-49],[26,0,-26],[20,0,-26]]},
              {type:"cell",name:"房间",routePoint:304,color:1,points:[[-28,0,-20],[-22,0,-20],[-22,0,-13],[-24,0,-13],[-24,0,-8],[-28,0,-8]]},
              {type:"cell",name:"设备间",routePoint:304,color:3,points:[[-24,0,-12],[-21,0,-12],[-21,0,-8],[-24,0,-8]]},
              {type:"cell",name:"扮戏房",routePoint:304,color:1,points:[[-9,0,-10],[-3,0,-10],[-3,0,-7],[-6,0,-7],[-6,0,1],[-9,0,1]]},
              {type:"cell",name:"扮戏房",routePoint:304,color:1,points:[[9,0,-10],[3,0,-10],[3,0,-7],[6,0,-7],[6,0,1],[9,0,1]]},
              {type:"cell",name:"除尘滤毒器",routePoint:304,color:1,points:[[13,0,-20],[19,0,-20],[19,0,-13],[13,0,-13]]},
              {type:"cell",name:"设备间-前室",routePoint:304,color:1,points:[[22,0,-20],[26,0,-20],[26,0,-13],[22,0,-13]]},
              {type:"cell",name:"服装间",routePoint:304,color:1,points:[[9,0,-12],[26,0,-12],[26,0,-8],[9,0,-8]]},
          ]
        }
      }
  },
  GFY: {},
  HMY: {},
  GXY: {},
  BGY: {}
};
